{
  "posts": [
    {
      "topic": "Why should I take prescribed hormones instead of street hormones? I know...",
      "user": "username",
      "message": "Why should I take prescribed hormones instead of street hormones? I know someone who can get me some really cheap.",
      "replies": [
        {
          "message": "Morbi aliquam molestie est non sodales. Curabitur et dolor vel metus tempor iaculis quis non libero. Sed in lectus viverra lorem feugiat scelerisque dapibus in odio. Nulla tempor consectetur justo. Sed velit lectus, lobortis sed convallis pharetra, placerat eget sapien.",
          "user": "another user"
        },
        {
          "message": "Pellentesque interdum varius enim, id ullamcorper risus bibendum vitae. Cras egestas, felis lacinia sollicitudin lacinia, magna odio tempus arcu, at iaculis ex est at purus. Nulla malesuada blandit sapien ut egestas. Nam eget justo enim. Donec magna nisi, congue vel leo vitae, scelerisque vehicula ante.",
          "user": "another user again"
        }
      ]
    },
    {
      "topic": "How do I come out to my parents?",
      "user": "username",
      "message": "Morbi aliquam molestie est non sodales. Curabitur et dolor vel metus tempor iaculis quis non libero. Sed in lectus viverra lorem feugiat scelerisque dapibus in odio. Nulla tempor consectetur justo. Sed velit lectus, lobortis sed convallis pharetra, placerat eget sapien. Nullam ultrices ullamcorper nunc in luctus. Mauris eu scelerisque justo, id bibendum leo. Nulla vel pellentesque est, a varius mi. Nullam dolor nibh, lobortis eu tempus a, ullamcorper sed est. Vestibulum mattis vel mauris ut consequat. Suspendisse potenti. Suspendisse in hendrerit nulla. Curabitur suscipit congue quam ac aliquet.",
      "replies": [
        {
          "message": "Vestibulum fermentum eget orci vel consequat. Etiam sodales, massa at hendrerit pharetra, elit ipsum gravida nisi, non luctus risus mauris a est. In venenatis, ligula vehicula commodo semper, lectus enim maximus lorem, ac imperdiet mauris magna nec massa.",
          "user": "another user"
        },
        {
          "message": "Morbi aliquam molestie est non sodales. Curabitur et dolor vel metus tempor iaculis quis non libero. Sed in lectus viverra lorem feugiat scelerisque dapibus in odio. Nulla tempor consectetur justo. Sed velit lectus, lobortis sed convallis pharetra, placerat eget sapien.",
          "user": "another user"
        },
        {
          "message": "Pellentesque interdum varius enim, id ullamcorper risus bibendum vitae. Cras egestas, felis lacinia sollicitudin lacinia, magna odio tempus arcu, at iaculis ex est at purus. Nulla malesuada blandit sapien ut egestas. Nam eget justo enim. Donec magna nisi, congue vel leo vitae, scelerisque vehicula ante.",
          "user": "another user again"
        }
      ]
    },
    {
      "topic": "Why do I feel angry lately?",
      "user": "username",
      "message": "This is my third sample message.",
      "replies": [
        {
          "message": "Vestibulum fermentum eget orci vel consequat. Etiam sodales, massa at hendrerit pharetra, elit ipsum gravida nisi, non luctus risus mauris a est. In venenatis, ligula vehicula commodo semper, lectus enim maximus lorem, ac imperdiet mauris magna nec massa.",
          "user": "another user"
        }
      ]
    },
    {
      "topic": "I am MTF and I have noticed a lump on my breast. Is this normal?",
      "user": "username",
      "message": "Why should I take prescribed hormones instead of street hormones? I know someone who can get me some really cheap.",
      "replies": [
        {
          "message": "Vestibulum fermentum eget orci vel consequat. Etiam sodales, massa at hendrerit pharetra, elit ipsum gravida nisi, non luctus risus mauris a est. In venenatis, ligula vehicula commodo semper, lectus enim maximus lorem, ac imperdiet mauris magna nec massa.",
          "user": "another user"
        },
        {
          "message": "Nullam ultrices ullamcorper nunc in luctus. Mauris eu scelerisque justo, id bibendum leo. Nulla vel pellentesque est, a varius mi. Nullam dolor nibh.",
          "user": "a second user"
        },
        {
          "message": "Curabitur et dolor vel metus tempor iaculis quis non libero. Sed in lectus viverra lorem feugiat scelerisque dapibus in odio.",
          "user": "another user again"
        }
      ]
    }
  ]
}

